app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 1]]
---
      def index
        post_id = params[:post_id]
        @comments = Comment.where({ post_id: }).order(:created_at)