app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jhilick.s@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "api_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-03-04 23:25:43.457587"], ["api_token", "a7SzPFAL5dVSQqfHzdNs"], ["id", 2]]
---
      def login

        valid = User.find_by(email: params[:email]).valid_password?(params[:password])

        if valid

          @user = User.find_by(email: params[:email])

          @user.api_token = Devise.friendly_token.to_s

          @user.save