app/views/posts/index.html.erb

  <div class="comments">
    <% post.recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["post_id", 7], ["post_id", 8], ["post_id", 9], ["post_id", 2], ["post_id", 10], ["post_id", 11], ["post_id", 3], ["post_id", 12]]