app/controllers/comments_controller.rb

UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 2]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(text: comment_parameters[:text], user_id: current_user.id, post_id: @post.id)

    respond_to do |format|
      format.html do
        if @comment.save